

using System;
class HelloWorld {
    /*Задача 23
    Напишите программу, которая принимает на вход число (N) и выдаёт таблицу 
    кубов чисел от 1 до N.*/
    
    static void Main() 
    {
    Console.WriteLine ("Введите число");
    int num = int.Parse (Console.ReadLine() ?? "");
    int count = 1;
    Console.Write($"{num} -> ");
    
    while(count < num)
    {
        Console.Write($"{Math.Pow(count, 3)}, "); //пишет через запятую и ставит "," в самом конце
        count += 1;
    }
    Console.Write($"{Math.Pow(num, 3)}"); // пишет крайний элемент 
  }
}
